Repository: 32bit-s-r-o/guest-registration-system
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: cs

source: Thank you for your message, %(name)s! We will get back to you soon.
cs: Děkujeme za vaši zprávu, %(name)s! Budeme vás kontaktovat brzy.

source: Please enter a confirmation code
cs: Prosím zadejte potvrzovací kód

source: Invalid confirmation code. Please check your code and try again.
cs: Neplatný potvrzovací kód. Prosím zkontrolujte svůj kód a zkuste to znovu.

source: Registration submitted successfully! You will receive an email once it is reviewed.
cs: Registrace byla úspěšně odeslána! Obdržíte email po jejím přezkoumání.

source: Invalid username or password
cs: Neplatné uživatelské jméno nebo heslo

source: Settings updated successfully!
cs: Nastavení bylo úspěšně aktualizováno!

source: Airbnb sync successful: %(message)s
cs: Synchronizace s Airbnb úspěšná: %(message)s

source: Airbnb sync failed: %(message)s
cs: Synchronizace s Airbnb selhala: %(message)s

source: Trip created successfully!
cs: Výlet byl úspěšně vytvořen!

source: Registration approved and email sent to user
cs: Registrace schválena a email odeslán uživateli

source: Registration rejected and email sent to user
cs: Registrace zamítnuta a email odeslán uživateli

source: Invoice created successfully!
cs: Faktura byla úspěšně vytvořena!

source: Invoice updated successfully!
cs: Faktura byla úspěšně aktualizována!

source: Invoice deleted successfully!
cs: Faktura byla úspěšně smazána!

source: Invoice status changed from %(old_status)s to %(new_status)s successfully!
cs: Stav faktury byl úspěšně změněn z %(old_status)s na %(new_status)s!

source: Invalid status provided.
cs: Poskytnut neplatný stav.

source: All data has been reset successfully! Admin accounts have been preserved.
cs: Všechna data byla úspěšně resetována! Administrátorské účty byly zachovány.

source: Error resetting data: %(error)s. Please use the command line tool: python quick_reset.py --confirm
cs: Chyba při resetování dat: %(error)s. Použijte prosím příkazový řádek: python quick_reset.py --confirm

source: Sample data has been seeded successfully! Created 5 trips, 7 registrations (including 1 single-person pending), 3 invoices with realistic data, and updated admin contact information.
cs: Ukázková data byla úspěšně načtena! Vytvořeno 5 výletů, 7 registrací (včetně 1 čekající jednotlivce), 3 faktury s realistickými daty a aktualizovány kontaktní informace administrátora.

source: Error seeding data: %(error)s
cs: Chyba při načítání dat: %(error)s

source: Database has been reset and seeded with sample data successfully! Admin accounts have been preserved. Created 5 trips and 6 registrations with various statuses. Sample document images have been copied to uploads directory.
cs: Databáze byla úspěšně resetována a načtena ukázkovými daty! Administrátorské účty byly zachovány. Vytvořeno 5 výletů a 6 registrací s různými stavy. Ukázkové obrázky dokumentů byly zkopírovány do složky uploads.

source: Error during reset and seed: %(error)s. Please use the command line tool: python quick_reset.py --reset-seed
cs: Chyba během resetování a načítání: %(error)s. Použijte prosím příkazový řádek: python quick_reset.py --reset-seed

source: Your registration has been approved!
cs: Vaše registrace byla schválena!

source: Dear Guest, Your registration for %(trip_title)s has been approved! Your personal data has been processed and all uploaded documents have been securely deleted in compliance with GDPR regulations. Thank you for choosing our service. Best regards, The Admin Team
cs: Vážený hoste, Vaše registrace pro %(trip_title)s byla schválena! Vaše osobní údaje byly zpracovány a všechny nahrané dokumenty byly bezpečně smazány v souladu s nařízením GDPR. Děkujeme za využití naší služby. S pozdravem, Administrátorský tým

source: Registration Update Required
cs: Vyžadována aktualizace registrace

source: Dear Guest, Your registration for %(trip_title)s requires updates. Admin Comment: %(admin_comment)s Please update your information using this link: %(update_link)s Thank you for your understanding. Best regards, The Admin Team
cs: Vážený hoste, Vaše registrace pro %(trip_title)s vyžaduje aktualizace. Komentář administrátora: %(admin_comment)s Prosím aktualizujte své informace pomocí tohoto odkazu: %(update_link)s Děkujeme za pochopení. S pozdravem, Administrátorský tým

source: Trip Title
cs: Název výletu

source: Status
cs: Stav

source: First Name
cs: Jméno

source: Last Name
cs: Příjmení

source: Age Category
cs: Věková kategorie

source: Document Type
cs: Typ dokumentu

source: Document Number
cs: Číslo dokumentu

source: GDPR Consent
cs: Souhlas s GDPR

source: Start Date
cs: Datum začátku

source: End Date
cs: Datum konce

source: Confirmation Code
cs: Potvrzovací kód

source: Invoice Number
cs: Číslo faktury

source: Client Name
cs: Jméno klienta

source: Client Email
cs: Email klienta

source: Issue Date
cs: Datum vystavení

source: Due Date
cs: Datum splatnosti

source: Subtotal
cs: Mezisoučet

source: VAT Total
cs: Celkem DPH

source: Total Amount
cs: Celková částka

source: Currency
cs: Měna

source: About Us
cs: O nás

source: Secure and compliant guest registration solutions for modern travel
cs: Bezpečný a GDPR kompatibilní systém registrace hostů pro vaše výlety a ubytování.

source: Why Choose Our System?
cs: Spravujte svůj systém

source: Automatic document deletion after approval
cs: Nahrané dokumenty budou automaticky smazány po schválení

source: Streamlined registration process
cs: Přezkoumat registrace

source: Instant email notifications
cs: Emailová oznámení

source: Admin dashboard for easy management
cs: Administrátorská nástěnka pro snadnou správu

source: Mobile-responsive design
cs: Responzivní design pro mobilní zařízení

source: User Experience
cs: Uživatelská zkušenost

source: Intuitive interface design
cs: Intuitivní návrh rozhraní

source: Clear progress indicators
cs: Jasné indikátory průběhu

source: Helpful validation messages
cs: Užitečné validační zprávy

source: Accessible for all users
cs: Přístupné pro všechny uživatele

source: Flexibility
cs: Flexibilita

source: Customizable trip settings
cs: Přizpůsobitelná nastavení výletů

source: Multiple document types supported
cs: Vyberte typ dokumentu

source: Scalable for any group size
cs: Škálovatelné pro jakoukoliv velikost skupiny

source: Easy admin management
cs: Správa dat

source: Our Team
cs: Náš tým

source: Contact Us
cs: Kontakt

source: Home
cs: Domů

source: About
cs: O nás

source: Contact
cs: Kontakt

source: Admin Dashboard
cs: Administrátorská nástěnka

source: Dashboard
cs: Nástěnka

source: Logout
cs: Odhlásit

source: Login
cs: Přihlásit

source: Confirm Registration
cs: Potvrdit registraci

source: Confirm Your Registration
cs: Potvrďte svou registraci

source: Please review your information before submitting
cs: Prosím zkontrolujte své informace před odesláním

source: Once submitted, your registration will be reviewed by an administrator. You will receive an email notification with the result.
cs: Po odeslání bude vaše registrace přezkoumána administrátorem. Obdržíte emailové oznámení s výsledkem.

source: Trip Information
cs: Informace o výletu

source: Maximum Guests
cs: Maximální počet hostů

source: Contact Information
cs: Kontaktní informace

source: Email Address
cs: Emailová adresa

source: Guest Information
cs: Informace o hostech

source: guest(s)
cs: host(é)

source: Guest
cs: Host

source: Name
cs: Jméno

source: Yes
cs: Ano

source: No
cs: Ne

source: Invoice Request
cs: Požadavek na fakturu

source: VAT Number
cs: DIČ

source: Billing Address
cs: Fakturační adresa

source: Go Back
cs: Zpět

source: Submit Registration
cs: Odeslat registraci

source: Guest Registration System
cs: Systém registrace hostů

source: Contact Person
cs: Kontaktní osoba

source: Phone
cs: Telefon

source: Website
cs: Webové stránky

source: Address
cs: Adresa

source: Send Message
cs: Odeslat zprávu

source: Your Name
cs: Vaše jméno

source: Your Email
cs: Váš email

source: Subject
cs: Předmět

source: Message
cs: Zpráva

source: Contact information not available.
cs: Kontaktní informace nejsou k dispozici.

source: Quick Links
cs: Rychlé odkazy

source: Register
cs: Registrovat

source: GDPR Privacy Policy
cs: Zásady ochrany osobních údajů (GDPR)

source: Your privacy and data protection rights are important to us
cs: Vaše soukromí a práva na ochranu údajů jsou pro nás důležité

source: Last updated: December 2024
cs: Poslední aktualizace: prosinec 2024

source: Important Notice
cs: Důležité upozornění

source: This privacy policy explains how we collect, use, and protect your personal data in accordance with the General Data Protection Regulation (GDPR) and other applicable data protection laws.
cs: Tato zásady ochrany osobních údajů vysvětlují, jak shromažďujeme, používáme a chráníme vaše osobní údaje v souladu s GDPR a dalšími platnými zákony o ochraně údajů.

source: Data Controller
cs: Správce údajů

source: Company
cs: Společnost

source: Your Company Address
cs: Adresa vaší společnosti

source: Your Contact Email
cs: Váš kontaktní email

source: Your Contact Phone
cs: Váš kontaktní telefon

source: Personal Data We Collect
cs: Osobní údaje, které shromažďujeme

source: Information you provide:
cs: Informace, které poskytujete:

source: Email address for communication
cs: Emailová adresa pro komunikaci

source: Personal Details
cs: Osobní údaje

source: First name, last name
cs: Jméno, příjmení

source: Identification
cs: Identifikace

source: Document type, document number
cs: Typ dokladu, číslo dokladu

source: Document Images
cs: Obrázky dokladů

source: Photos of identification documents (temporarily stored)
cs: Fotografie identifikačních dokladů (dočasně uložené)

source: Consent
cs: Souhlas

source: GDPR consent confirmation
cs: Potvrzení souhlasu s GDPR

source: Automatically collected information:
cs: Automaticky shromažďované informace:

source: Technical Data
cs: Technické údaje

source: IP address, browser type, device information
cs: IP adresa, typ prohlížeče, informace o zařízení

source: Usage Data
cs: Údaje o používání

source: Pages visited, time spent on site
cs: Navštívené stránky, čas strávený na webu

source: Session cookies for functionality
cs: Relační cookies pro funkčnost

source: How We Use Your Data
cs: Jak používáme vaše údaje

source: Legal basis for processing:
cs: Právní základ zpracování:

source: You have given explicit consent for data processing
cs: Udělili jste výslovný souhlas se zpracováním údajů

source: Legitimate Interest
cs: Oprávněný zájem

source: To provide guest registration services
cs: Pro poskytování služeb registrace hostů

source: Contract
cs: Smlouva

source: To fulfill registration obligations
cs: Pro splnění registračních povinností

source: Purposes of processing:
cs: Účely zpracování:

source: Process guest registrations for trips
cs: Zpracování registrací hostů na výlety

source: Verify guest identities and documents
cs: Ověření totožnosti hostů a dokladů

source: Communicate registration status and updates
cs: Komunikace stavu a aktualizací registrace

source: Ensure compliance with travel regulations
cs: Zajištění souladu s cestovními předpisy

source: Improve our services and user experience
cs: Zlepšování našich služeb a uživatelského zážitku

source: Data Sharing and Transfers
cs: Sdílení a přenos údajů

source: We may share your data with:
cs: Vaše údaje můžeme sdílet s:

source: Trip Organizers
cs: Organizátoři výletů

source: Only the specific admin managing your trip
cs: Pouze konkrétní administrátor spravující váš výlet

source: Service Providers
cs: Poskytovatelé služeb

source: Email services, hosting providers (under strict contracts)
cs: Emailové služby, poskytovatelé hostingu (na základě smluv)

source: Legal Authorities
cs: Právní orgány

source: When required by law or to protect rights
cs: Pokud to vyžaduje zákon nebo k ochraně práv

source: Data transfers:
cs: Přenosy údajů:

source: All data is stored within the European Economic Area (EEA)
cs: Všechna data jsou uložena v rámci Evropského hospodářského prostoru (EHP)

source: Any international transfers comply with GDPR requirements
cs: Jakékoli mezinárodní přenosy splňují požadavky GDPR

source: We use appropriate safeguards for data protection
cs: Používáme vhodná opatření pro ochranu údajů

source: Data Retention
cs: Doba uchovávání údajů

source: Retention periods:
cs: Doby uchovávání:

source: Automatically deleted immediately after approval
cs: Automaticky smazáno ihned po schválení

source: Registration Data
cs: Údaje o registraci

source: Retained for 2 years after trip completion
cs: Uchováváno 2 roky po skončení výletu

source: Retained for 2 years for communication purposes
cs: Uchováváno 2 roky pro účely komunikace

source: Technical Logs
cs: Technické záznamy

source: Retained for 90 days for security purposes
cs: Uchováváno 90 dní pro bezpečnostní účely

source: Deletion process:
cs: Proces mazání:

source: Automatic deletion of documents after approval
cs: Automatické smazání dokumentů po schválení

source: Regular review and deletion of expired data
cs: Pravidelná kontrola a mazání expirovaných dat

source: Secure deletion methods to prevent recovery
cs: Bezpečné metody mazání pro zabránění obnovení

source: Your Rights
cs: Vaše práva

source: Under GDPR, you have the following rights:
cs: Podle GDPR máte následující práva:

source: Right to Access
cs: Právo na přístup

source: Request a copy of your personal data and information about how it's processed.
cs: Požádejte o kopii svých osobních údajů a informace o jejich zpracování.

source: Right to Rectification
cs: Právo na opravu

source: Request correction of inaccurate or incomplete personal data.
cs: Požádejte o opravu nepřesných nebo neúplných osobních údajů.

source: Right to Erasure
cs: Právo na výmaz

source: Request deletion of your personal data (subject to legal requirements).
cs: Požádejte o výmaz svých osobních údajů (v souladu s právními požadavky).

source: Right to Restrict Processing
cs: Právo na omezení zpracování

source: Request limitation of data processing in certain circumstances.
cs: Požádejte o omezení zpracování údajů v určitých případech.

source: Right to Data Portability
cs: Právo na přenositelnost údajů

source: Receive your data in a structured, machine-readable format.
cs: Získejte svá data ve strukturovaném, strojově čitelném formátu.

source: Right to Object
cs: Právo vznést námitku

source: Object to processing based on legitimate interests.
cs: Vznést námitku proti zpracování na základě oprávněného zájmu.

source: How to Exercise Your Rights
cs: Jak uplatnit svá práva

source: To exercise any of these rights, please contact us at
cs: Pro uplatnění těchto práv nás prosím kontaktujte na

source: with your request. We will respond within 30 days.
cs: se svou žádostí. Odpovíme do 30 dnů.

source: Data Security
cs: Bezpečnost údajů

source: Security measures:
cs: Bezpečnostní opatření:

source: Encryption of data in transit and at rest
cs: Šifrování dat při přenosu i uložení

source: Regular security audits and updates
cs: Pravidelné bezpečnostní audity a aktualizace

source: Access controls and authentication
cs: Kontrola přístupu a autentizace

source: Secure deletion of sensitive documents
cs: Bezpečné mazání citlivých dokumentů

source: Incident response:
cs: Reakce na incidenty:

source: 24/7 monitoring for security incidents
cs: Nepřetržité monitorování bezpečnostních incidentů

source: Immediate response to data breaches
cs: Okamžitá reakce na úniky dat

source: Notification to authorities within 72 hours
cs: Oznámení úřadům do 72 hodin

source: Communication with affected individuals
cs: Komunikace s dotčenými osobami

source: Cookies and Tracking
cs: Cookies a sledování

source: Types of cookies we use:
cs: Typy cookies, které používáme:

source: Essential Cookies
cs: Nezbytné cookies

source: Required for basic functionality
cs: Nezbytné pro základní funkčnost

source: Session Cookies
cs: Relační cookies

source: Maintain your login session
cs: Udržují vaše přihlášení

source: Analytics Cookies
cs: Analytické cookies

source: Help us improve our service (optional)
cs: Pomáhají nám zlepšovat služby (volitelné)

source: Cookie management:
cs: Správa cookies:

source: You can control cookies through your browser settings
cs: Cookies můžete spravovat v nastavení prohlížeče

source: Essential cookies cannot be disabled
cs: Nezbytné cookies nelze vypnout

source: Analytics cookies are optional and can be refused
cs: Analytické cookies jsou volitelné a lze je odmítnout

source: If you have any questions about this privacy policy or our data practices, please contact us:
cs: Pokud máte jakékoli dotazy k těmto zásadám nebo našim postupům, kontaktujte nás:

source: Data Protection Officer
cs: Pověřenec pro ochranu osobních údajů

source: For complex data protection inquiries, you may also contact our Data Protection Officer at the same contact details above.
cs: V případě složitějších dotazů na ochranu údajů můžete kontaktovat našeho pověřence pro ochranu osobních údajů na výše uvedených kontaktech.

source: Changes to This Policy
cs: Změny těchto zásad

source: We may update this privacy policy from time to time to reflect changes in our practices or applicable laws.
cs: Tyto zásady můžeme čas od času aktualizovat podle změn v našich postupech nebo platných zákonech.

source: How we notify you of changes:
cs: Jak vás informujeme o změnách:

source: We will post the updated policy on our website
cs: Aktualizované zásady zveřejníme na našem webu

source: We will notify you by email for significant changes
cs: O významných změnách vás budeme informovat e-mailem

source: The effective date will be clearly indicated
cs: Datum účinnosti bude jasně uvedeno

source: If you disagree with any changes to this policy, you have the right to request deletion of your data and discontinue use of our services.
cs: Pokud s některými změnami nesouhlasíte, máte právo požádat o výmaz svých údajů a ukončit používání našich služeb.

source: Back to Home
cs: Zpět na úvodní stránku

source: Welcome to Guest Registration
cs: Vítejte v systému registrace hostů

source: Secure and GDPR-compliant guest registration system for your trips and accommodations.
cs: Bezpečný a GDPR kompatibilní systém registrace hostů pro vaše výlety a ubytování.

source: Secure & Compliant
cs: Bezpečné a kompatibilní

source: Full GDPR compliance with automatic document deletion after approval.
cs: Plná GDPR kompatibilita s automatickým mazáním dokumentů po schválení.

source: Easy to Use
cs: Snadné použití

source: Simple registration process with mobile-friendly interface.
cs: Jednoduchý registrační proces s mobilně přívětivým rozhraním.

source: Email Notifications
cs: Emailová oznámení

source: Receive email updates about your registration status and any required actions.
cs: Obdržíte emailové aktualizace o stavu vaší registrace a případných požadovaných akcích.

source: How it works:
cs: Jak to funguje:

source: Fill out the registration form with guest information
cs: Vyplňte registrační formulář s informacemi o hostech

source: Upload required identification documents
cs: Nahrajte požadované identifikační dokumenty

source: Review and confirm your information
cs: Zkontrolujte a potvrďte své informace

source: Submit for admin approval
cs: Odešlete ke schválení administrátorem

source: Receive email notification with the result
cs: Obdržíte emailové oznámení s výsledkem

source: Available Trips
cs: Dostupné výlety

source: Contact your trip organizer to get the registration link for your specific trip.
cs: Kontaktujte organizátora výletu pro získání registračního odkazu pro váš konkrétní výlet.

source: Start Registration
cs: Začít registraci

source: Have your Airbnb confirmation code ready!
cs: Mějte připravený svůj Airbnb potvrzovací kód!

source: Guest Registration
cs: Registrace hostů

source: guests
cs: hostů

source: Important Information
cs: Důležité informace

source: All personal data is handled according to GDPR regulations
cs: Všechna osobní data jsou zpracovávána podle nařízení GDPR

source: Uploaded documents will be automatically deleted after approval
cs: Nahrané dokumenty budou automaticky smazány po schválení

source: One email address is required for the entire group
cs: Jedna emailová adresa je vyžadována pro celou skupinu

source: Each guest must provide valid identification
cs: Každý host musí poskytnout platnou identifikaci

source: Enter email address for the group
cs: Zadejte emailovou adresu pro skupinu

source: This email will be used for all communications about this registration.
cs: Tento email bude použit pro všechnu komunikaci ohledně této registrace.

source: I would like to request an invoice for this registration
cs: Chtěl bych požádat o fakturu pro tuto registraci

source: Full name for invoice
cs: Celé jméno pro fakturu

source: VAT number (optional)
cs: DIČ (volitelné)

source: Enter billing address
cs: Zadejte fakturační adresu

source: Add Another Guest
cs: Přidat dalšího hosta

source: Continue to Review
cs: Pokračovat k přezkoumání

source: Select age category
cs: Vyberte věkovou kategorii

source: Adult
cs: Dospělý

source: Child
cs: Dítě

source: Select document type
cs: Vyberte typ dokumentu

source: Passport
cs: Pas

source: Driving License
cs: Řidičský průkaz

source: Citizen ID
cs: Občanský průkaz

source: Document Image
cs: Obrázek dokumentu

source: Upload a clear photo of the document
cs: Nahrajte jasnou fotografii dokumentu

source: I consent to the processing of my personal data according to GDPR regulations
cs: Souhlasím se zpracováním mých osobních údajů podle nařízení GDPR

source: Remove Guest
cs: Odebrat hosta

source: Photo upload is optional for adults
cs: Nahrání fotografie je pro dospělé nepovinné

source: Photo upload is optional for children
cs: Nahrání fotografie je pro děti nepovinné

source: Please enter your Airbnb confirmation code to proceed with your registration.
cs: Prosím zadejte svůj Airbnb potvrzovací kód pro pokračování v registraci.

source: Airbnb Confirmation Code
cs: Airbnb potvrzovací kód

source: Enter your confirmation code
cs: Zadejte svůj potvrzovací kód

source: This is the confirmation code from your Airbnb reservation email.
cs: Toto je potvrzovací kód z vašeho Airbnb rezervačního emailu.

source: Continue to Registration
cs: Pokračovat k registraci

source: Need Help?
cs: Potřebujete pomoc?

source: If you can't find your confirmation code, please check your Airbnb reservation email or contact your host for assistance.
cs: Pokud nemůžete najít svůj potvrzovací kód, zkontrolujte prosím svůj Airbnb rezervační email nebo kontaktujte svého hostitele pro pomoc.

source: About This Service
cs: O této službě

source: Registration Submitted
cs: Registrace odeslána

source: Registration Submitted Successfully!
cs: Registrace byla úspěšně odeslána!

source: Thank you for submitting your guest registration. Your information has been received and is now pending admin approval.
cs: Děkujeme za odeslání vaší registrace hostů. Vaše informace byly přijaty a nyní čekají na schválení administrátorem.

source: What happens next?
cs: Co se stane dál?

source: An administrator will review your registration within 24-48 hours
cs: Administrátor přezkoumá vaši registraci do 24-48 hodin

source: You will receive an email notification with the approval status
cs: Obdržíte emailové oznámení se stavem schválení

source: If approved, your uploaded documents will be automatically deleted for GDPR compliance
cs: Pokud bude schválena, vaše nahrané dokumenty budou automaticky smazány pro GDPR kompatibilitu

source: If any corrections are needed, you'll receive a link to update your information
cs: Pokud budou potřeba nějaké opravy, obdržíte odkaz pro aktualizaci vašich informací

source: Data Protection
cs: Ochrana dat
