Repository: 32bit-s-r-o/guest-registration-system
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: cs

source: Your personal data is protected according to GDPR regulations. All uploaded documents will be securely deleted after approval to ensure your privacy.
cs: Vaše osobní údaje jsou chráněny podle nařízení GDPR. Všechny nahrané dokumenty budou bezpečně smazány po schválení pro zajištění vašeho soukromí.

source: Back to Dashboard
cs: Zpět na nástěnku

source: Total Trips
cs: Celkem výletů

source: Pending Registrations
cs: Čekající registrace

source: Quick Actions
cs: Rychlé akce

source: Manage your system
cs: Spravujte svůj systém

source: Recent Trips
cs: Poslední výlety

source: No trips created yet.
cs: Zatím nebyly vytvořeny žádné výlety.

source: View All Trips
cs: Zobrazit všechny výlety

source: New Trip
cs: Nový výlet

source: Review Registrations
cs: Přezkoumat registrace

source: Manage Invoices
cs: Spravovat faktury

source: Settings
cs: Nastavení

source: Data Management
cs: Správa dat

source: Edit Invoice
cs: Upravit fakturu

source: Back to Invoice
cs: Zpět k faktuře

source: Invoice Details
cs: Detaily faktury

source: VAT Number (if applicable)
cs: DIČ (pokud je k dispozici)

source: Client Address
cs: Adresa klienta

source: Invoice Items
cs: Položky faktury

source: Add Item
cs: Přidat položku

source: Notes
cs: Poznámky

source: Additional notes or terms...
cs: Dodatečné poznámky nebo podmínky...

source: Summary
cs: Souhrn

source: Total
cs: Celkem

source: Update Invoice
cs: Aktualizovat fakturu

source: Cancel
cs: Zrušit

source: Description
cs: Popis

source: Quantity
cs: Množství

source: Unit Price
cs: Jednotková cena

source: VAT %
cs: DPH %%

source: Line Total
cs: Řádek celkem

source: VAT Amount
cs: Částka DPH

source: Total with VAT
cs: Celkem s DPH

source: Paid
cs: Zaplaceno

source: Actions
cs: Akce

source: Client
cs: Klient

source: Sent
cs: Odesláno

source: Draft
cs: Koncept

source: Overdue
cs: Po splatnosti

source: Invoices
cs: Faktury

source: All Statuses
cs: Všechny stavy

source: New Invoice
cs: Nová faktura

source: Invoice List
cs: Seznam faktur

source: Invoice #
cs: Faktura #

source: View
cs: Zobrazit

source: Edit
cs: Upravit

source: Delete
cs: Smazat

source: No Invoices Yet
cs: Zatím žádné faktury

source: Create your first invoice to get started.
cs: Vytvořte svou první fakturu pro začátek.

source: Create First Invoice
cs: Vytvořit první fakturu

source: Confirm Delete
cs: Potvrdit smazání

source: Are you sure you want to delete this invoice? This action cannot be undone.
cs: Opravdu chcete smazat tuto fakturu? Tuto akci nelze vrátit zpět.

source: Delete Invoice
cs: Smazat fakturu

source: Admin Login
cs: Přihlášení administrátora

source: Username
cs: Uživatelské jméno

source: Password
cs: Heslo

source: Back to Invoices
cs: Zpět k fakturám

source: Create Invoice
cs: Vytvořit fakturu

source: Created
cs: Vytvořeno

source: Admin Settings
cs: Nastavení

source: Profile Settings
cs: Nastavení

source: New Password
cs: Heslo

source: Account Created
cs: Vytvořeno

source: Airbnb Calendar Integration
cs: Airbnb potvrzovací kód

source: Airbnb Listing ID
cs: Airbnb potvrzovací kód

source: Last Sync
cs: Příjmení

source: Important
cs: Důležité informace

source: Photo Upload Configuration
cs: Konfigurace nahrávání fotografií

source: Photo Upload Settings
cs: Nastavení nahrávání fotografií

source: Configure whether document photos are required for adult and child guests during registration.
cs: Nakonfigurujte, zda jsou fotografie dokumentů povinné pro dospělé a dětské hosty během registrace.

source: Adults Photo Requirement
cs: Požadavek na fotografie dospělých

source: Require document photos for adult guests
cs: Vyžadovat fotografie dokumentů pro dospělé hosty

source: When enabled, adult guests must upload a photo of their identification document
cs: Když je povoleno, dospělí hosté musí nahrát fotografii svého identifikačního dokumentu

source: Children Photo Requirement
cs: Požadavek na fotografie dětí

source: Require document photos for child guests
cs: Vyžadovat fotografie dokumentů pro dětské hosty

source: When enabled, child guests must upload a photo of their identification document
cs: Když je povoleno, dětské hosty musí nahrát fotografii svého identifikačního dokumentu

source: Document photos are automatically deleted after registration approval for GDPR compliance.
cs: Pokud bude schválena, vaše nahrané dokumenty budou automaticky smazány pro GDPR kompatibilitu

source: Company Name
cs: Jméno klienta

source: Contact Name
cs: Kontakt

source: Company identification number (optional)
cs: DIČ (volitelné)

source: VAT identification number (optional)
cs: DIČ (volitelné)

source: Phone Number
cs: Číslo faktury

source: Enter your full address
cs: Zadejte fakturační adresu

source: Your website URL (optional)
cs: DIČ (volitelné)

source: Custom Lines
cs: Další řádky

source: Custom Line 1
cs: Další řádky

source: Custom information
cs: Další informace

source: Additional information field
cs: Kontaktní informace

source: Sync Information
cs: Informace o faktuře

source: How Airbnb Sync Works
cs: Jak to funguje:

source: Updates
cs: Aktualizovat

source: Number of guests
cs: Maximální počet hostů

source: Reservation status
cs: Stav rezervace

source: Guest contact information (for privacy)
cs: Kontaktní informace

source: Payment information
cs: Informace o klientovi

source: Save Settings
cs: Nastavení

source: Invoice
cs: Faktura

source: Client Information
cs: Informace o klientovi

source: Invoice Information
cs: Informace o faktuře

source: No items found for this invoice.
cs: Pro tuto fakturu nebyly nalezeny žádné položky.

source: Change Status
cs: Změnit stav

source: Update
cs: Aktualizovat

source: Download PDF
cs: Stáhnout PDF

source: Print Invoice
cs: Vytisknout fakturu

source: Invoice Info
cs: Informace o faktuře

source: Last Updated
cs: Naposledy aktualizováno

source: Items Count
cs: Počet položek

source: Error updating status
cs: Chyba při aktualizaci stavu
